##########################################
# Config
##########################################
cask_args appdir: "/Applications"

##########################################
# Tap
##########################################
tap "homebrew/cask"



##########################################
# Essential Cli
##########################################
brew "jq"
brew "autojump"
brew "qrencode"

##########################################
# Essential GUI
##########################################
cask "gpg-suite"
cask "joplin"
cask "rectangle"
cask "flycut"
cask "iterm2"
cask "nextcloud"
cask "the-unarchiver"
cask "appcleaner"
cask "veracrypt"
cask "google-chrome"
cask "spotify"
cask "macpass"
cask "osxfuse"

##########################################
# Dev stuff CLI
##########################################
brew "stow"
brew "nvm"

##########################################
# Dev stuff GUI
##########################################
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "keybase"


##########################################
# Work CLI
##########################################
brew "awscli"
brew "tfenv"
brew "terraform"
brew "openjdk"
brew "mitmproxy"
brew "timewarrior"

##########################################
# Work GUI
##########################################
cask "firefox"
#cask "firefox-developer-edition"
cask "microsoft-edge"
#cask "microsoft-edge-beta"
#cask "safari-technology-preview"
cask "slack"
cask "zoom"
# cask "abstract"
# cask "zeplin"


##########################################
# Optional
##########################################
# cask "adobe-creative-cloud"
# cask "wireshark"
# cask "owasp-zap"
# cask "home-assistant"
# brew "pock"


