##########################################
# Config
##########################################
cask_args appdir: "/Applications"

##########################################
# Tap
##########################################
tap "homebrew/cask"

##########################################
# Mac apps
##########################################
cask "gpg-suite"
cask "slack"
cask "zoomus"
cask "joplin"
cask "spotify"
cask "rectangle"

##########################################
# Cli stuff
##########################################
brew "jq"
brew "timewarrior"
brew "autojump"
brew "ffmpeg"
brew "qrencode"

##########################################
# Dev stuff GUI
##########################################
cask "docker"
cask "visual-studio-code"

##########################################
# Dev stuff CLI
##########################################
cask "iterm2"
brew "stow"
brew "nvm"

##########################################
# Work stuff
##########################################
# brew "awscli"
# brew "tfenv"
# brew "terraform"
# brew "openjdk"
# brew "mitmproxy"
